export const ww = {
  '00': '晴',
  '11': '大暴雨',
  '22': '中到大雨',
  '01': '多云',
  '12': '特大暴雨',
  '23': '大到暴雨',
  '02': '阴',
  '13': '阵雪',
  '24': '暴雨到大暴雨',
  '03': '阵雨',
  '14': '小雪',
  '25': '大暴雨到特大',
  '04': '雷阵雨',
  '15': '中雪',
  '26': '小到中雪',
  '05': '雷阵雨伴冰雹',
  '16': '大雪',
  '27': '中到大雪',
  '06': '雨夹雪',
  '17': '暴雪',
  '28': '大雪到暴雪',
  '07': '小雨',
  '18': '雾',
  '29': '浮尘',
  '08': '中雨',
  '19': '冻雨',
  '30': '扬沙',
  '09': '大雨',
  '20': '沙尘暴',
  '31': '强沙尘暴',
  '10': '暴雨',
  '21': '小到中雨',
  '53': '霾'
}

export const ws = {
  '0': '微风',
  '1': '3-4级',
  '2': '4-5级',
  '3': '5-6级',
  '4': '6-7级',
  '5': '7-8级',
  '6': '8-9级',
  '7': '9-10级',
  '8': '10-11级'
}

export const wd = {
  '0': '',
  '1': '东北风',
  '2': '东风',
  '3': '东南风',
  '4': '南风',
  '5': '西南风',
  '6': '西风',
  '7': '西北风',
  '8': '北风'
}

export const wwClassName = (ww1, ww2) => {
  const ww = parseInt(ww1) >= parseInt(ww2) ? ww1 : ww2
  if (ww == 0)
    return 'sunny'
  if (ww == 2)
    return 'overcast' // 阴天
  else if (ww == 3 || (ww >= 6 && ww <= 12) || ww == 19 || (ww >= 21 && ww <= 25))
    return 'rainy'
  else if (ww == 1)
    return 'cloudy'
  else if (ww >= 4 && ww <= 5)
    return 'lightning'
  else if ((ww >= 14 && ww <= 17) || (ww >= 26 && ww <= 28))
    return 'snowy'
  else if (ww == 18 || ww == 53)
    return 'sunny'
  else
    return 'sunny'
}