<template>
  <div class="file">
    <div class="wrapper">
      <div class="left" id="sidebar">
        <div class="nav">
          <div :class="['cate', index === 0 ? 'active' : '']" @click="index = 0">
            <span>决策服务指引</span>
            <span :class="[index === 0 ? 'el-icon-minus' : 'el-icon-plus']"></span>
          </div>
          <el-collapse-transition>
            <div v-show="index === 0" class="collapse">
              <div class="name" :class="[articleIndex === 0 && index === 0 ? 'active' : '']">
                <span>浙江省智能网格气象预报业务产品文件名</span>
              </div>
              <div class="name">
                <span>浙江省智能网格气象预报业</span>
              </div>
            </div>
          </el-collapse-transition>
        </div>

        <div class="nav">
          <div :class="['cate', index === 1 ? 'active' : '']" @click="index = 1">
            <span>气象呈文件</span>
            <span :class="[index === 1 ? 'el-icon-minus' : 'el-icon-plus']"></span>
          </div>
          <el-collapse-transition>
            <div v-show="index === 1" class="collapse">
              <div class="name">
                <span>浙江省智能网格气象预报业务产品文件名</span>
              </div>
              <div class="name">
                <span>浙江省智能网格气象预报业2</span>
              </div>
            </div>
          </el-collapse-transition>
        </div>

      </div>
      <div class="right">
        <article>
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
          浙江省气象局紧密围绕第七次全国气象预报工作会议和《现代气象预报业务发展规划》提出的现代气象预报业务无缝隙、精准化、智慧型的发展方向，以浙江预报业务发展现状作为落脚点和出发点，确立浙江省智能网格预报业务“共织一张网，共建一把尺”的发展目标，认真贯彻落实中国气象局关于推进智能网格预报业务实施的工作部署，扎实推进我省智能网格预报业务开展。
        </article>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    data () {
      return {
        show: false,
        index: 0,
        articleIndex: 0
      }
    }
  }
</script>

<style scoped lang="stylus">
  .file
    display flex
    min-height 800px
    position relative
    .wrapper
      width 1400px
      margin 0 auto
      position relative
      .left
        float left
        padding-top 50px
        padding-right 25px
        padding-bottom 1px
        height 100%
      #sidebar
        background #f5f5f5
        padding-left 200%
        margin-left -200%
        border-right 1px solid #eeeeee
        .nav
          width 220px
          margin-top 10px
          .cate
            height 40px
            border 1px solid #e5e5e5
            font-size 14px
            padding 0 10px 0 20px
            line-height 38px
            display flex
            align-items center
            justify-content space-between
            &:hover,  &.active
              background-color #0066cc
              border 1px solid #0066cc
              cursor pointer
              span
                color #ffffff
          &:first-child
            margin-top 0px
          
        .collapse
          background-color #eeeeee
          width 220px
          .name
            font-size 12px
            line-height 18px
            padding 5px 20px
            span
              cursor pointer
            &:first-child
              padding-top 15px
            &:last-child 
              padding-bottom 15px
            &.active, &:hover
             span
              color #0066cc

      .right
        float none
        width 1160px
        margin-left 245px
        padding-top 50px
        padding-left 100px
        padding-bottom 50px

        
        

</style>